{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.17.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 9600, 5], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv1d_input"}}, {"class_name": "Conv1D", "config": {"name": "conv1d", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 9600, 5], "filters": 256, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d", "trainable": true, "dtype": "float32", "strides": [1], "pool_size": [2], "padding": "same", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "trainable": true, "dtype": "float32", "strides": [1], "pool_size": [2], "padding": "same", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Conv1D", "config": {"name": "conv1d_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "trainable": true, "dtype": "float32", "strides": [1], "pool_size": [2], "padding": "same", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": false, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of151.bin", "group1-shard2of151.bin", "group1-shard3of151.bin", "group1-shard4of151.bin", "group1-shard5of151.bin", "group1-shard6of151.bin", "group1-shard7of151.bin", "group1-shard8of151.bin", "group1-shard9of151.bin", "group1-shard10of151.bin", "group1-shard11of151.bin", "group1-shard12of151.bin", "group1-shard13of151.bin", "group1-shard14of151.bin", "group1-shard15of151.bin", "group1-shard16of151.bin", "group1-shard17of151.bin", "group1-shard18of151.bin", "group1-shard19of151.bin", "group1-shard20of151.bin", "group1-shard21of151.bin", "group1-shard22of151.bin", "group1-shard23of151.bin", "group1-shard24of151.bin", "group1-shard25of151.bin", "group1-shard26of151.bin", "group1-shard27of151.bin", "group1-shard28of151.bin", "group1-shard29of151.bin", "group1-shard30of151.bin", "group1-shard31of151.bin", "group1-shard32of151.bin", "group1-shard33of151.bin", "group1-shard34of151.bin", "group1-shard35of151.bin", "group1-shard36of151.bin", "group1-shard37of151.bin", "group1-shard38of151.bin", "group1-shard39of151.bin", "group1-shard40of151.bin", "group1-shard41of151.bin", "group1-shard42of151.bin", "group1-shard43of151.bin", "group1-shard44of151.bin", "group1-shard45of151.bin", "group1-shard46of151.bin", "group1-shard47of151.bin", "group1-shard48of151.bin", "group1-shard49of151.bin", "group1-shard50of151.bin", "group1-shard51of151.bin", "group1-shard52of151.bin", "group1-shard53of151.bin", "group1-shard54of151.bin", "group1-shard55of151.bin", "group1-shard56of151.bin", "group1-shard57of151.bin", "group1-shard58of151.bin", "group1-shard59of151.bin", "group1-shard60of151.bin", "group1-shard61of151.bin", "group1-shard62of151.bin", "group1-shard63of151.bin", "group1-shard64of151.bin", "group1-shard65of151.bin", "group1-shard66of151.bin", "group1-shard67of151.bin", "group1-shard68of151.bin", "group1-shard69of151.bin", "group1-shard70of151.bin", "group1-shard71of151.bin", "group1-shard72of151.bin", "group1-shard73of151.bin", "group1-shard74of151.bin", "group1-shard75of151.bin", "group1-shard76of151.bin", "group1-shard77of151.bin", "group1-shard78of151.bin", "group1-shard79of151.bin", "group1-shard80of151.bin", "group1-shard81of151.bin", "group1-shard82of151.bin", "group1-shard83of151.bin", "group1-shard84of151.bin", "group1-shard85of151.bin", "group1-shard86of151.bin", "group1-shard87of151.bin", "group1-shard88of151.bin", "group1-shard89of151.bin", "group1-shard90of151.bin", "group1-shard91of151.bin", "group1-shard92of151.bin", "group1-shard93of151.bin", "group1-shard94of151.bin", "group1-shard95of151.bin", "group1-shard96of151.bin", "group1-shard97of151.bin", "group1-shard98of151.bin", "group1-shard99of151.bin", "group1-shard100of151.bin", "group1-shard101of151.bin", "group1-shard102of151.bin", "group1-shard103of151.bin", "group1-shard104of151.bin", "group1-shard105of151.bin", "group1-shard106of151.bin", "group1-shard107of151.bin", "group1-shard108of151.bin", "group1-shard109of151.bin", "group1-shard110of151.bin", "group1-shard111of151.bin", "group1-shard112of151.bin", "group1-shard113of151.bin", "group1-shard114of151.bin", "group1-shard115of151.bin", "group1-shard116of151.bin", "group1-shard117of151.bin", "group1-shard118of151.bin", "group1-shard119of151.bin", "group1-shard120of151.bin", "group1-shard121of151.bin", "group1-shard122of151.bin", "group1-shard123of151.bin", "group1-shard124of151.bin", "group1-shard125of151.bin", "group1-shard126of151.bin", "group1-shard127of151.bin", "group1-shard128of151.bin", "group1-shard129of151.bin", "group1-shard130of151.bin", "group1-shard131of151.bin", "group1-shard132of151.bin", "group1-shard133of151.bin", "group1-shard134of151.bin", "group1-shard135of151.bin", "group1-shard136of151.bin", "group1-shard137of151.bin", "group1-shard138of151.bin", "group1-shard139of151.bin", "group1-shard140of151.bin", "group1-shard141of151.bin", "group1-shard142of151.bin", "group1-shard143of151.bin", "group1-shard144of151.bin", "group1-shard145of151.bin", "group1-shard146of151.bin", "group1-shard147of151.bin", "group1-shard148of151.bin", "group1-shard149of151.bin", "group1-shard150of151.bin", "group1-shard151of151.bin"], "weights": [{"name": "batch_normalization/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_1/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_2/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv1d/kernel", "shape": [1, 5, 256], "dtype": "float32"}, {"name": "conv1d/bias", "shape": [256], "dtype": "float32"}, {"name": "conv1d_1/kernel", "shape": [1, 256, 128], "dtype": "float32"}, {"name": "conv1d_1/bias", "shape": [128], "dtype": "float32"}, {"name": "conv1d_2/kernel", "shape": [1, 128, 64], "dtype": "float32"}, {"name": "conv1d_2/bias", "shape": [64], "dtype": "float32"}, {"name": "dense/kernel", "shape": [614400, 256], "dtype": "float32"}, {"name": "dense/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [64, 2], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [2], "dtype": "float32"}]}]}